#encoding:utf-8
import pymysql,datetime
today= datetime.datetime.today().strftime('%m%d')
print(type(today))
# db = pymysql.connect(host='192.168.91.40',port=4040,user='root',passwd='root',db='my_server')
# cur =  db.cursor()
#
# #复制并重置表格
# print('create new table.......')
# cur.execute('create table server_for_2018%s like server_for_20180706'%today) #copy
# cur.execute('truncate server_for_2018%s'%today)
# db.commit()
#


# print('insert date to table....')
# #插入每日数据
# updat_sql = '''
# insert into server_for_2018%s(hostname,ip,cpu,task,menory,disk)values
# ('mysql',        '120.78.86.254',   5,    132,   17.3,   '71-0-0-1-0-0'),
#
# ('portal',       '120.78.86.29',	    1,	  142,   7.42,	 '39-0-0-1-0-0'),
#
# ('qb充值',	       '47.100.90.52',	4,	147,   41.15,    '9-3-2-22'),
#
# ('svn',	          '120.78.87.162',	0.1,	86,     1.3,	  '5-0-0-1-0-0'),
#
# ('测试机',	       '120.24.173.64',	1,	330,	44.1,	  '32-0-68'),
# ('充值吧',	      '43.243.130.43',	0.1,   298,  5.4,	  '9-0-1-53-4'),
# ('第三方组件10', '120.78.84.10',	   18,   125,	   25.87,	'10-0-0-1-0-0-0-0'),
# ('第三方组件147',	'120.78.86.147',	15,	  130,	   23.6,	'13-0-0-1-0-0-0'),
# ('后台服务器178',	'120.77.218.178',	100,	120,	6.9,	'20-0-0-1-0-0-0'),
# ('后台服务器60',	'120.78.75.60',	0.1,	90,	   7.07,	    '25-0-0-1-0-0-0'),
#
# ('话费80',         '45.126.120.80',	0.1,  1071,	  12.7,   '4-0-24-53-36'),
# ('话费81',	       '45.126.120.81',	0.1,   915,	   48.95,	    '2-45-30-57-68'),
# ('话费82',	        '45.126.120.82',	0.1,	910,	8.12,	'2-1-22-55-67'),
#
# ('话费83',	       '45.126.120.83',	0.1,	881,	7.79,	   '3-1-6-57-69'),
#
# ('话费84',	      '45.126.120.84',	0.1,	617,	10.2,	'40-4-51-4-43-1'),
# ('话费85',	     '45.126.120.85',  	0.1	,   641,   56.5,	'13-1-35-69-1-1'),
#
# ('流量充值',	 '47.100.95.135',	    8,	164,	23.1,	   '9-1-8-72')
# '''%today
# cur.execute(updat_sql)
# db.commit()
# db.close()
# print('ok')
#
#
#
